fprintf('======================================================================\n');
fprintf('                   《换乘方案算法——不对方案排序》\n');
fprintf('运行环境：MATLAB 8.3.0.532 \n');
fprintf('作者信息：兰州交通大学  刘志祥   QQ：531548824\n');
fprintf('说明：本程序用于在已知路网数据时，通过输入起讫点求直达、一次、二次换乘方案。\n')
fprintf('======================================================================\n\n');
%% 符号体系
%% 路网数据符号
%==========================================================================
% luwangshuju-路网数据，包括站数据（点编号），线数据（线编号），站—线数据（站与线的0-1矩阵，表示站是否在线上），线-站数据（线与站的0-1矩阵，表示线是否包含站），路权数据（如行驶时间或距离）。
% A-起点
% B-终点
% zhan-站集合，本程序中站点以V开头编号
% xian-线集合，可理解为公交车名称，如k102等
% zhan_xian-线与站的关系，表示线路上有哪些站点
%==========================================================================

%% 数据处理符号
%==========================================================================
% zhan_xian_01-线与站的01矩阵，行表示线，列表示站，0表示不在该线，1表示在该线上
% xian_zhan_01-站与线的01矩阵，行表示站，列表示线，0表示线不经过站，1表示经过，与zhan_xian_01互为转置矩阵
%==========================================================================

%% 换乘次数符号
%==========================================================================
% KHc_cishu-换乘次数
% KHc_hcd-换乘点
% KHc_hcqj-换乘区间
% KHc_hcld_a-换乘路段
%==========================================================================

%% K短路算法符号
%==========================================================================
% KPaths-有效路径
% KCosts-有效路径的费用（本文指时间）
%==========================================================================