%==========================================================================
% 数据处理
% 运算依赖于luwangshuju.m
% 主要运算结果【得到普通线站关系的01矩阵】...
%==========================================================================

%以下代码用于换乘算法
%% 线_站单元数组转换为01矩阵
%==========================================================================
xian_zhan_01=zeros(length(xian),length(zhan));
for i=1:length(xian)
    xian_zhan_01(i,xian_zhan{i})=1;
end
zhan_xian_01=xian_zhan_01';
%==========================================================================

%以下代码用于K短路算法
%% 根据路网对路段进行自动标号并求出每个路段的距离
%==========================================================================
for i=1:length(Road_Net)
    for j=1:length(Road_Net)
        if Road_Net(i,j)~=0&Road_Net(i,j)~=inf
            a=a+1;
            luduan_zhan{a}={i,j};
            W_luduan{a}=Road_Net(i,j);
        end
    end
end
%==========================================================================
